<?php
/*----------------全局业务数据配置---------------------*/ 
return array(
    //文章状态
    'ARTICLE_STATUS' => array('1'=>'新投稿','2'=>'上线'),
    //文章状态
    'ARTICLE_SOURCE' => array('1'=>'原创','2'=>'转载','3'=>'整理'),
    //寄售资格
    'CONSIGN_QUALI' => array('1'=>'普通用户','2'=>'申请中','3'=>'寄售用户','4'=>'拒绝寄售申请'),
    'CONSIGN_QUALI_VAL' => array('common'=>'1','apply'=>'2','qualified'=>'3','refuse'=>'4'),
    //寄售状态
    'CONSIGN_STATUS' => array('1'=>'等待审核','2'=>'请修改','3'=>'修改完毕,等待审核','4'=>'请寄送商品','5'=>'已寄出,等待收货','6'=>'已收到,等待上架','7'=>'已转为商品','8'=>'拒绝寄售'),
    'CONSIGN_STATUS_VAL' => array('wait'=>'1','modify'=>'2','update'=>'3','pre_send'=>'4','send'=>'5','receive'=>'6','turn_goods'=>'7','refuse'=>'8'),
    //寄售商品分类
    'CONSIGN_CAT' => array('4'=>'刊物','5'=>'无料传单','6'=>'和纸胶带','7'=>'动漫周边'),
    //商品状态
    'GOODS_STATUS' => array('1'=>'预售','2'=>'现货','3'=>'补货'),
    //订单状态
    'ORDER_STATUS'     => array('1'=>'待付款','2'=>'已支付','3'=>'配货中','4'=>'发货中','5'=>'已收货','6'=>'已完成','7'=>'已取消'),
    'ORDER_STATUS_VAL' => array('toPay'=> 1 ,'hasPay'=>'2','assort'=>'3','send'=>'4','receive'=>'5','finish'=>'6','cancel'=>'7'),
    //售后状态
    'SERVICE_STATUS' => array('1'=>'待处理','2'=>'已处理','3'=>'不通过'),
    //快递公司
    'EXPRESS_COM' => array('1'=>'顺丰快递','2'=>'圆通快递','3'=>'申通快递','4'=>'中通快递','5'=>'韵达快递'),
    'EXPRESS_COM_ABBR' => array('1'=>'shunfeng','2'=>'yuantong','3'=>'shentong','4'=>'zhongtong','5'=>'yunda'),
    //支付方式
    'PAY_WAY' => array('1'=>'支付宝','2'=>'微信支付'),
//------------------------------------------------------------------------------------------------
);
?>
